Pandas is used in data analytics to get insights from large amounts of data

<h1>Dataframe Basics</h1>
<h3>Topics</h3>
<ul>
    <li>Creating Dataframe</li>
    <li>Dealing with rows and columns</li>
    <li>Operations:min, max, std, describe</li>
    <li>Conditional Selection</li>
    <li>set_index</li>
</ul>
<p>Dataframes are objects(methods and attributes) that are used to represent tabular data e.g excel files, CSVs, SQL etc</p>

In [25]:
import pandas as pd
# Importing data to dataframe
df = pd.read_csv("weather_data_nyc_centralpark_2016(1).csv") # Specify name of csv and use pd.read_csv

# Dataframe from python dictionary where the keys are column names an rows are values
dict1 = {
    'day': ['1/1/2017', '1/2/2017', '1/3/2017', '1/4/2017', '1/5/2017', '1/6/2017'],
    'temperature': [32, 35, 28, 24, 32, 31],
    'windspeed': [6, 7, 2, 7, 4, 2],
    'event': ['Rain', 'Sunny', 'Snow', 'Snow', 'Rain', 'Sunny']
}
df2 = pd.DataFrame(dict1)
print(df2.shape) # Gets number of rows and columns in dataframe
print(df2.head())  # Gets inital rows, df.tail(x) prints last x rows
print(df2.columns) # Prints the columns in the dataframe

# Printing shape, first or last x rows, columns

(6, 4)
        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

In [10]:
# Indexing dataframe
print(df2[2:5])  # Returns a new dataframe that contains the 2nd to 4th rows of dataframe(rows and columns)
print(df2['day']) # Returns series containing data in specific column
# To get a specific item, index the column and row e.g
print(df2['day'][0])
# To get multiple columns index with a list of column names
print(df2[['day', 'event', 'temperature']]) # Returns a new dataframe with only the specified columns

        day  temperature  windspeed event
2  1/3/2017           28          2  Snow
3  1/4/2017           24          7  Snow
4  1/5/2017           32          4  Rain
0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: day, dtype: object
1/1/2017
        day  event  temperature
0  1/1/2017   Rain           32
1  1/2/2017  Sunny           35
2  1/3/2017   Snow           28
3  1/4/2017   Snow           24
4  1/5/2017   Rain           32
5  1/6/2017  Sunny           31

In [17]:
# Operations
print(df2['temperature'].max())  # Get biggest element
# Mean - .mean(), Std - .std(), .min()
print(df2.describe()) # To get general stats
# You can also index with a condition
print(df2[df2.temperature > 32]) # -> Select all columns were temperature > 32
print(df2[['day', 'temperature']][df2.temperature >= 32]) # -> Select day, temperature FROM df2 WHERE temperature >= 32

35
       temperature  windspeed
count     6.000000   6.000000
mean     30.333333   4.666667
std       3.829708   2.338090
min      24.000000   2.000000
25%      28.750000   2.500000
50%      31.500000   5.000000
75%      32.000000   6.750000
max      35.000000   7.000000
        day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny
        day  temperature
0  1/1/2017           32
1  1/2/2017           35
4  1/5/2017           32

In [27]:
# Change the index of the dataframe
df2.set_index('day', inplace=True)  # Updates the dataframe and makes the index column to be day
df2.loc['1/1/2017'] # Used to get a row at that index value

temperature      32
windspeed         6
event          Rain
Name: 1/1/2017, dtype: object

<h1>Different Ways of Creating Dataframe</h1>
<h3>Topics</h3>
<ol>
    <li>Using CSV</li>
    <li>Using Excel</li>
    <li>From python dictionary</li>
    <li>From list of tuples</li>
    <li>From list of dictionaries</li>
</ol>

In [28]:
df = pd.read_csv('weather_data_nyc_centralpark_2016(1).csv')
# Used to read from excel file pd.read_excel('file_name', 'sheet_name')
# pd.DataFrame(dictionary) - keys are column names and values are rows
days = ('1/1/2017', '1/2/2017', '1/3/2017')
temperature = (32, 35, 28)
windspeed = (6, 7, 2)
event = ('Rain', 'Sunny', 'Snow')
dataframe_data = zip(days, temperature, windspeed, event) # Creates a list of tuples
df = pd.DataFrame(dataframe_data, columns=['Day', 'Temperature', 'Windspeed', 'Event']) # Specify column names
df
# pd.DataFrame(data) can also be used to create a dataframe from a list of dictionaries, where each dictionary has values 
# for one row

        Day  Temperature  Windspeed  Event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow

<h1>Reading and writing CSV and Excel Files</h1>
<h3>Topics</h3>
<ul>
    <li>Read CSV</li>
    <li>Write CSV</li>
    <li>Read Excel</li>
    <li>Write Excel</li>
</ul>

In [44]:
# Options for reading from CSV
# df = pd.read_csv('weather_data_nyc_centralpark_2016(1).csv') - Default
# Problem with default is that if there are any rows that don't contain the data the dataframe won't be imported well
df = pd.read_csv('weather_data_nyc_centralpark_2016(1).csv', skiprows=1) # Skips first row coz it has useless data

# Let's say the CSV file has no header names
df2 = pd.read_csv('weather_data_nyc_centralpark_2016(2).csv') # This makes panda assume that first row is header
df2 = pd.read_csv('weather_data_nyc_centralpark_2016(2).csv', header=None) # Tells panda that there is no header but it automatically generates header names
df2 = pd.read_csv('weather_data_nyc_centralpark_2016(2).csv', header=None, 
                   names=['date', 'maximum temperature', 'minimum temperature', 'average temperature', 'precipitation', 'snow fall', 'snow depth'])

# Let's say that the CSV has represented missing values with certain strings or symbols
# In this case missing values are represented with NA, missing, 9000 and T
df3 = pd.read_csv('weather_data_nyc_centralpark_2016(2).csv', header=None, 
                names=['date', 'maximum temperature', 'minimum temperature', 'average temperature', 'precipitation', 'snow fall', 'snow depth'], 
                na_values={ # Allows you to specify missing values for specific columns
                    'snow depth': ['NA', 'missing', 9000],
                    'date': [42]
                })
df3

,date,maximum temperature,minimum temperature,average temperature,precipitation,snow fall,snow depth
0,NaN,42,34,38.0,0.00,0.0,NaN
1,2-1-2016,40,32,36.0,0.00,0.0,NaN
2,3-1-2016,45,35,40.0,0.00,0.0,0
3,4-1-2016,36,14,25.0,0.00,0.0,NaN
4,5-1-2016,29,11,20.0,0.00,0.0,0
...,...,...,...,...,...,...,...
361,27-12-2016,60,40,50.0,0,0,0
362,28-12-2016,40,34,37.0,0,0,0
363,29-12-2016,46,33,39.5,0.39,0,0
364,30-12-2016,40,33,36.5,0.01,T,0
365,31-12-2016,44,31,37.5,0,0,0

In [48]:
# Export dataframe as CSV
df3.to_csv('new.csv') # Creates a problem, the index was included into the CSV! 
df3.to_csv('new.csv', index=False)
# columns arguement is a list of the columns you want to export as CSV
df3.to_csv('new.csv', index=False, header=False) # To not export header names as well
# To use a function to convert certain values to another use converters arguement

# To export dataframe as excel file use df.to_excel('filename', sheet_name='sheet') # Same parameters from to_csv are applicable
# Use pd.ExcelWriter('filename') to write multiple dataframes to same excel file but different sheets

<h1>Handle Missing Data</h1>
<h3>Topics</h3>
<ul>
    <li>fillna</li>
    <li>interpolate</li>
    <li>dropna</li>
    <li>replace</li>
</ul>

In [85]:
df = pd.read_csv('weather_data_nyc_centralpark_2016(2).csv', na_values=['NA', 'T'], parse_dates=['date'])
# parse_dates - Tells python what column it should treat as containing dates
df.set_index('date', inplace=True)
df

/tmp/ipykernel_71300/1783265657.py:1: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  df = pd.read_csv('weather_data_nyc_centralpark_2016(2).csv', na_values=['NA', 'T'], parse_dates=['date'])

,maximum temperature,minimum temperature,average temperature,precipitation,snow fall,snow depth
date,,,,,,
2016-01-01,NaN,NaN,NaN,NaN,NaN,NaN
2016-02-01,40 C,32.0,36.0,0.00,0.0,0.0
2016-06-01,41,25.0,33.0 F,0.00,0.0,0.0
2016-07-01,46,31.0,38.5,0.00,0.0,0.0
2016-08-01,46,31.0,38.5,0.00,0.0,0.0
...,...,...,...,...,...,...
2016-12-27,60,40.0,50,0.00,0.0,0.0
2016-12-28,40,34.0,37,0.00,0.0,0.0
2016-12-29,46,33.0,39.5,0.39,0.0,0.0
2016-12-30,40,33.0,36.5,0.01,NaN,0.0
2016-12-31,44,31.0,37.5,0.00,0.0,0.0

In [57]:
# Fill NaN values
df2 = df.fillna(0)
df2  # Not the best approach because in some cases it doesn't make sense to have a zero value e.g in maximum temp

,maximum temperature,minimum temperature,average temperature,precipitation,snow fall,snow depth
date,,,,,,
NaT,0.0,0.0,0.0,0.00,0.0,0.0
2016-02-01,40.0,32.0,36.0,0.00,0.0,0.0
2016-06-01,41.0,25.0,33.0,0.00,0.0,0.0
2016-07-01,46.0,31.0,38.5,0.00,0.0,0.0
2016-08-01,46.0,31.0,38.5,0.00,0.0,0.0
...,...,...,...,...,...,...
2016-12-27,60.0,40.0,50.0,0.00,0.0,0.0
2016-12-28,40.0,34.0,37.0,0.00,0.0,0.0
2016-12-29,46.0,33.0,39.5,0.39,0.0,0.0
2016-12-30,40.0,33.0,36.5,0.01,0.0,0.0
2016-12-31,44.0,31.0,37.5,0.00,0.0,0.0

In [62]:
df3 = df.fillna({
    'maximum temperature': 10,
    'minimum temperature': 0,
    'average temperature': 0,
    'precipitation': 10.0,
    'snow fall': 0,
    'snow depth': 0
})
df3

,maximum temperature,minimum temperature,average temperature,precipitation,snow fall,snow depth
date,,,,,,
NaT,10.0,0.0,0.0,10.00,0.0,0.0
2016-02-01,40.0,32.0,36.0,0.00,0.0,0.0
2016-06-01,41.0,25.0,33.0,0.00,0.0,0.0
2016-07-01,46.0,31.0,38.5,0.00,0.0,0.0
2016-08-01,46.0,31.0,38.5,0.00,0.0,0.0
...,...,...,...,...,...,...
2016-12-27,60.0,40.0,50.0,0.00,0.0,0.0
2016-12-28,40.0,34.0,37.0,0.00,0.0,0.0
2016-12-29,46.0,33.0,39.5,0.39,0.0,0.0
2016-12-30,40.0,33.0,36.5,0.01,0.0,0.0
2016-12-31,44.0,31.0,37.5,0.00,0.0,0.0

In [64]:
# Fills NaNs with value before it but is limited to filling 5 values in a row like this
df4 = df.fillna(method='bfill', limit=5)
df4

,maximum temperature,minimum temperature,average temperature,precipitation,snow fall,snow depth
date,,,,,,
NaT,40.0,32.0,36.0,0.00,0.0,0.0
2016-02-01,40.0,32.0,36.0,0.00,0.0,0.0
2016-06-01,41.0,25.0,33.0,0.00,0.0,0.0
2016-07-01,46.0,31.0,38.5,0.00,0.0,0.0
2016-08-01,46.0,31.0,38.5,0.00,0.0,0.0
...,...,...,...,...,...,...
2016-12-27,60.0,40.0,50.0,0.00,0.0,0.0
2016-12-28,40.0,34.0,37.0,0.00,0.0,0.0
2016-12-29,46.0,33.0,39.5,0.39,0.0,0.0
2016-12-30,40.0,33.0,36.5,0.01,0.0,0.0
2016-12-31,44.0,31.0,37.5,0.00,0.0,0.0

In [69]:
df5 = df.interpolate(method='time')
df5

,maximum temperature,minimum temperature,average temperature,precipitation,snow fall,snow depth
date,,,,,,
2016-01-01,NaN,NaN,NaN,NaN,NaN,NaN
2016-02-01,40.0,32.0,36.0,0.00,0.0,0.0
2016-06-01,41.0,25.0,33.0,0.00,0.0,0.0
2016-07-01,46.0,31.0,38.5,0.00,0.0,0.0
2016-08-01,46.0,31.0,38.5,0.00,0.0,0.0
...,...,...,...,...,...,...
2016-12-27,60.0,40.0,50.0,0.00,0.0,0.0
2016-12-28,40.0,34.0,37.0,0.00,0.0,0.0
2016-12-29,46.0,33.0,39.5,0.39,0.0,0.0
2016-12-30,40.0,33.0,36.5,0.01,0.0,0.0
2016-12-31,44.0,31.0,37.5,0.00,0.0,0.0

In [73]:
df6 = df.dropna(how='all')  # The how attribute tells it when to drop NaN values, in this case it drops when entire row is empty
df6.shape
# The thresh attribute tells it the minimum number of non NaN values to have so that it doesn't drop it

(362, 6)

In [83]:
# To add missing date values
# Create a date range
date_range = pd.date_range(df.index[0], df.index[-1])
idx = pd.DatetimeIndex(date_range)
df7 = df.reindex(idx)
df7.head(10)  # Not sure but looks like dataframe changed

,maximum temperature,minimum temperature,average temperature,precipitation,snow fall,snow depth
2016-01-01,NaN,NaN,NaN,NaN,NaN,NaN
2016-01-02,59.0,44.0,51.5,0.01,0.0,2.0
2016-01-03,52.0,39.0,45.5,0.00,0.0,0.0
2016-01-04,79.0,61.0,70.0,0.02,0.0,0.0
2016-01-05,51.0,45.0,48.0,0.16,0.0,0.0
2016-01-06,83.0,66.0,74.5,0.00,0.0,0.0
2016-01-07,79.0,66.0,72.5,0.83,0.0,0.0
2016-01-08,80.0,69.0,74.5,NaN,0.0,0.0
2016-01-09,79.0,69.0,74.0,0.50,0.0,0.0
2016-01-10,62.0,56.0,59.0,0.00,0.0,0.0

In [84]:
import numpy as np
df8 = df.replace(np.NaN, 'LOL') # Can accept a list of values to replace with new value or a dictionary with name of 
# column as key and the value to replace
df9 = df.replace({
    'LOL': np.NaN,
    40.0: 'Exchanged'
}) # You can also give replace a dict with the value to replace and the one to put in its place

,maximum temperature,minimum temperature,average temperature,precipitation,snow fall,snow depth
date,,,,,,
2016-01-01,LOL,LOL,LOL,LOL,LOL,LOL
2016-02-01,40.0,32.0,36.0,0.0,0.0,0.0
2016-06-01,41.0,25.0,33.0,0.0,0.0,0.0
2016-07-01,46.0,31.0,38.5,0.0,0.0,0.0
2016-08-01,46.0,31.0,38.5,0.0,0.0,0.0
...,...,...,...,...,...,...
2016-12-27,60.0,40.0,50.0,0.0,0.0,0.0
2016-12-28,40.0,34.0,37.0,0.0,0.0,0.0
2016-12-29,46.0,33.0,39.5,0.39,0.0,0.0
2016-12-30,40.0,33.0,36.5,0.01,LOL,0.0
2016-12-31,44.0,31.0,37.5,0.0,0.0,0.0

In [86]:
# You want to remove the units of measurement i.e C, F from the data, one way to do this is to use regex to search
# for text and replace that text with nothing
df9 = df.replace({
    'average temperature': '[A-Za-z]',
    'maximum temperature': '[A-Za-z]'
}, '', regex=True) # regex parameter indicates whether regex is been used
df9

,maximum temperature,minimum temperature,average temperature,precipitation,snow fall,snow depth
date,,,,,,
2016-01-01,NaN,NaN,NaN,NaN,NaN,NaN
2016-02-01,40,32.0,36.0,0.00,0.0,0.0
2016-06-01,41,25.0,33.0,0.00,0.0,0.0
2016-07-01,46,31.0,38.5,0.00,0.0,0.0
2016-08-01,46,31.0,38.5,0.00,0.0,0.0
...,...,...,...,...,...,...
2016-12-27,60,40.0,50,0.00,0.0,0.0
2016-12-28,40,34.0,37,0.00,0.0,0.0
2016-12-29,46,33.0,39.5,0.39,0.0,0.0
2016-12-30,40,33.0,36.5,0.01,NaN,0.0
2016-12-31,44,31.0,37.5,0.00,0.0,0.0

<h1>Group By</h2>
<h3>Topics</h3>
<ul>
    <li>Split</li>
    <li>Apply</li>
    <li>Combine</li>
</ul>

In [88]:
city_data = {
    'day': ['1/1/2017', '1/2/2017', '1/3/2017', '1/4/2017', '1/1/2017', '1/2/2017', '1/3/2017', '1/4/2017', '1/1/2017', '1/2/2017', '1/3/2017', '1/4/2017'],
    'city': ['new york', 'new york', 'new york', 'new york', 'mumbai', 'mumbai', 'mumbai', 'mumbai', 'paris', 'paris', 'paris', 'paris'],
    'temperature': [32, 36, 28, 33, 90, 85, 87, 92, 45, 50, 54, 42],
    'windspeed': [6, 7, 12, 7, 5, 12, 15, 5, 20, 13, 8, 10],
    'event': ['Rain', 'Sunny', 'Snow', 'Sunny', 'Sunny', 'Fog', 'Fog', 'Rain', 'Sunny', 'Cloudy', 'Cloudy', 'Cloudy']
}
city_df = pd.DataFrame(city_data)
city_df

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [92]:
# Group by city
g = city_df.groupby('city')

# Loop through returned iterable
for key, val in g:
    print(key)
    print(val)

g.get_group('paris')

mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [97]:
# Operations
# Get max of all the columns of all the groups
g.max().loc['mumbai', 'temperature']

92